Revit 2026 API

# DockPosition Enumeration

---

Which part of the Revit application frame the pane should dock to.

**Namespace:** Autodesk.Revit.UI**Assembly:** RevitAPIUI (in RevitAPIUI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public enum DockPosition
```
```vb
Public Enumeration DockPosition
```
```cpp
public enum class DockPosition
```
```fsharp
type DockPosition
```

| Member name | Value | Description |
| --- | --- | --- |
| Bottom | 59,422 |  |
| Floating | 59,423 |  |
| Left | 59,420 |  |
| Right | 59,421 |  |
| Tabbed | 59,424 |  |
| Top | 59,419 |  |

#### Reference

Autodesk.Revit.UI Namespace